app/views/shared/_user_info.html.erb

    <span class="events">
      <%= pluralize(current_user.events.count, "event") %>
---
SELECT COUNT(*) FROM "events" WHERE ("events".user_id = 1)