app/views/events/_unfollow.html.erb

<%= form_for @event.reverse_relationships.find_by_followed_id(@event),
             :html => { :method => :delete } do |f| %>
---
SELECT "relationships".* FROM "relationships" WHERE ("relationships".follower_id = 2) AND ("relationships"."followed_id" = 1) LIMIT 1