app/controllers/events_controller.rb

  def index
    @title = "All events"
    @events = Event.paginate(:page => params[:page])
---
SELECT "events".* FROM "events" ORDER BY events.created_at DESC LIMIT 30 OFFSET 0

  def show
    @event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE ("events"."id" = 3) ORDER BY events.created_at DESC LIMIT 1

  def edit
    @event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE ("events"."id" = 3) ORDER BY events.created_at DESC LIMIT 1

  def create
    @event = current_user.events.build(params[:event])
    @event.user_id = current_user.id

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("zip", "state", "description", "street", "updated_at", "latitude", "city", "created_at", "name", "longitude", "user_id") VALUES (93940, 'CA', 'no telling what you''ll get', '4012 Malloway', '2011-03-05 18:10:12.832946', 36.3894233, 'Monterey', '2011-03-05 18:10:12.832946', 'Be awesome!!', -121.9052047, 3)

  def destroy
    @event.destroy
---
DELETE FROM "events" WHERE ("events"."id" = 2)