app/controllers/relationships_controller.rb

  def create
    @event = Event.find(params[:relationship][:followed_id])
---
SELECT "events".* FROM "events" WHERE ("events"."id" = 1) ORDER BY events.created_at DESC LIMIT 1

  def destroy
    @user = Relationship.find(params[:id]).followed
---
SELECT "relationships".* FROM "relationships" WHERE ("relationships".follower_id = 2) AND ("relationships"."followed_id" = 1) LIMIT 1

  def index
    @title = "Events Tasks"
    @relationships = Relationship.paginate(:page => params[:page])
---
SELECT "relationships".* FROM "relationships" LIMIT 30 OFFSET 0