app/controllers/users_controller.rb

  def following
    @title = "Following"
    @user  = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1