app/controllers/users_controller.rb

  def index
    @title = "All users"
    @users = User.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" LIMIT 30 OFFSET 0

  def show
    @user = current_user
    @events = @user.events.paginate(:page => params[:page])
---
SELECT "events".* FROM "events" WHERE ("events".user_id = 1) ORDER BY events.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "events" INNER JOIN "relationships" ON "events".id = "relationships".followed_id WHERE (("relationships".follower_id = 1))

  def create
    @user = User.new(params[:user])
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("username", "email", "crypted_password", "password_salt", "persistence_token", "created_at", "updated_at", "admin") VALUES ('shuchton', 'shuchton@gmail.com', '4477f7c589ab9928f9b68c011e6c3b8d1e1551b291fbc53c8e48df80e3036273eaa7ebda689e0895630054fb0bc3543863a72500fda0ec5196f77db28c743390', 'uo8dUQKl1TY0k9OpGtnc', '82ac1db1d744152574c582f5f6ff5a8322e3c3e69ff0426e5bac9de09573f59663bdf0b26c3ca62f88e800e48dd6aac3817c9f59ba806812ea5b612d95f0f64f', '2011-03-06 05:09:10.118208', '2011-03-06 05:09:10.118208', NULL)

  def task
    @title = "Tasks"
    @user  = current_user
    @event = Event.find(params[:id])
    @relationship = Relationship.find_by_follower_id_and_followed_id(@user.id, params[:id])
---
SELECT "events".* FROM "events" WHERE ("events"."id" = 3) ORDER BY events.created_at DESC LIMIT 1
SELECT "relationships".* FROM "relationships" WHERE ("relationships"."followed_id" = 3) AND ("relationships"."follower_id" = 1) LIMIT 1