app/controllers/user_sessions_controller.rb

  def create
    @user_session = UserSession.new(params[:user_session])

    respond_to do |format|
      if @user_session.save
---
INSERT INTO "user_sessions" ("updated_at", "created_at", "password", "username") VALUES ('2011-02-24 00:53:49.325242', '2011-02-24 00:53:49.325242', 'greg', 'greg')

  def destroy
    @user_session = UserSession.find(params[:id])
    @user_session.destroy
---
SELECT "user_sessions".* FROM "user_sessions" WHERE ("user_sessions"."id" = 2) LIMIT 1
DELETE FROM "user_sessions" WHERE ("user_sessions"."id" = 2)